{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["timedistributed_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"input_dtype": "int32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 50]}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"batch_input_shape": [null, 50], "dropout": 0.2, "name": "embedding_2", "input_dim": 3852, "W_regularizer": null, "trainable": true, "W_constraint": null, "input_length": 50, "input_dtype": "int32", "init": "uniform", "mask_zero": false, "activity_regularizer": null, "output_dim": 50}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_2"}, {"class_name": "LSTM", "config": {"forget_bias_init": "one", "dropout_W": 0.0, "stateful": false, "init": "glorot_uniform", "name": "lstm_1", "dropout_U": 0.0, "input_dim": 50, "unroll": false, "W_regularizer": null, "trainable": true, "inner_init": "orthogonal", "input_length": null, "b_regularizer": null, "inner_activation": "hard_sigmoid", "consume_less": "cpu", "go_backwards": false, "return_sequences": true, "U_regularizer": null, "output_dim": 128, "activation": "tanh"}, "inbound_nodes": [[["embedding_2", 0, 0]]], "name": "lstm_1"}, {"class_name": "LSTM", "config": {"forget_bias_init": "one", "dropout_W": 0.0, "stateful": false, "init": "glorot_uniform", "name": "lstm_2", "dropout_U": 0.0, "input_dim": 50, "unroll": false, "W_regularizer": null, "trainable": true, "inner_init": "orthogonal", "input_length": null, "b_regularizer": null, "inner_activation": "hard_sigmoid", "consume_less": "cpu", "go_backwards": true, "return_sequences": true, "U_regularizer": null, "output_dim": 128, "activation": "tanh"}, "inbound_nodes": [[["embedding_2", 0, 0]]], "name": "lstm_2"}, {"class_name": "Merge", "config": {"dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "name": "merge_1", "output_shape": null, "mode": "concat", "concat_axis": -1}, "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 4, "activation": "softmax"}}, "name": "timedistributed_1"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "timedistributed_1"}]}, "keras_version": "1.1.0"}