{"config": {"output_layers": [["timedistributed_2", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 50], "input_dtype": "int32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 50], "input_dtype": "int32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "name": "embedding_2", "W_constraint": null, "output_dim": 50, "input_dtype": "int32", "input_length": 50, "input_dim": 3888, "batch_input_shape": [null, 50], "init": "uniform", "dropout": 0.2, "W_regularizer": null}, "class_name": "Embedding", "name": "embedding_2", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"trainable": true, "mask_zero": false, "activity_regularizer": null, "name": "embedding_3", "W_constraint": null, "output_dim": 3, "input_dtype": "int32", "input_length": 50, "input_dim": 3, "batch_input_shape": [null, 50], "init": "uniform", "dropout": 0.0, "W_regularizer": null}, "class_name": "Embedding", "name": "embedding_3", "inbound_nodes": [[["input_2", 0, 0]]]}, {"config": {"mode": "concat", "concat_axis": -1, "mode_type": "raw", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "name": "merge_1"}, "class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["embedding_2", 0, 0], ["embedding_3", 0, 0]]]}, {"config": {"trainable": true, "padding": 2, "name": "zeropadding1d_1"}, "class_name": "ZeroPadding1D", "name": "zeropadding1d_1", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"trainable": true, "name": "lstm_1", "return_sequences": true, "go_backwards": false, "output_dim": 128, "U_regularizer": null, "b_regularizer": null, "consume_less": "cpu", "dropout_W": 0.0, "inner_activation": "hard_sigmoid", "unroll": false, "input_length": null, "stateful": false, "dropout_U": 0.0, "init": "glorot_uniform", "input_dim": 53, "inner_init": "orthogonal", "activation": "tanh", "W_regularizer": null, "forget_bias_init": "one"}, "class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"trainable": true, "name": "lstm_2", "return_sequences": true, "go_backwards": true, "output_dim": 128, "U_regularizer": null, "b_regularizer": null, "consume_less": "cpu", "dropout_W": 0.0, "inner_activation": "hard_sigmoid", "unroll": false, "input_length": null, "stateful": false, "dropout_U": 0.0, "init": "glorot_uniform", "input_dim": 53, "inner_init": "orthogonal", "activation": "tanh", "W_regularizer": null, "forget_bias_init": "one"}, "class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"trainable": true, "activity_regularizer": null, "nb_filter": 50, "name": "convolution1d_1", "W_constraint": null, "activation": "linear", "b_regularizer": null, "subsample_length": 1, "init": "uniform", "input_length": null, "filter_length": 5, "input_dim": null, "b_constraint": null, "bias": true, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution1D", "name": "convolution1d_1", "inbound_nodes": [[["zeropadding1d_1", 0, 0]]]}, {"config": {"mode": "concat", "concat_axis": -1, "mode_type": "raw", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "name": "merge_2"}, "class_name": "Merge", "name": "merge_2", "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]]}, {"config": {"trainable": true, "p": 0.1, "name": "dropout_2"}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"config": {"trainable": true, "layer": {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 50, "b_regularizer": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, "name": "timedistributed_1"}, "class_name": "TimeDistributed", "name": "timedistributed_1", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"config": {"mode": "concat", "concat_axis": 2, "mode_type": "raw", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "name": "merge_3"}, "class_name": "Merge", "name": "merge_3", "inbound_nodes": [[["dropout_1", 0, 0], ["timedistributed_1", 0, 0]]]}, {"config": {"trainable": true, "layer": {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 7, "b_regularizer": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "softmax", "W_regularizer": null}, "class_name": "Dense"}, "name": "timedistributed_2"}, "class_name": "TimeDistributed", "name": "timedistributed_2", "inbound_nodes": [[["merge_3", 0, 0]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "keras_version": "1.1.0", "class_name": "Model"}