{"config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "int32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 50]}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_2", "config": {"output_dim": 50, "input_length": 50, "init": "uniform", "dropout": 0.2, "mask_zero": false, "activity_regularizer": null, "batch_input_shape": [null, 50], "input_dtype": "int32", "W_regularizer": null, "W_constraint": null, "input_dim": 3967, "name": "embedding_2", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "ZeroPadding1D", "name": "zeropadding1d_1", "config": {"name": "zeropadding1d_1", "trainable": true, "padding": 2}, "inbound_nodes": [[["embedding_2", 0, 0]]]}, {"class_name": "LSTM", "name": "lstm_1", "config": {"go_backwards": false, "output_dim": 128, "input_length": null, "dropout_U": 0.0, "consume_less": "cpu", "init": "glorot_uniform", "inner_init": "orthogonal", "return_sequences": true, "stateful": false, "trainable": true, "dropout_W": 0.0, "forget_bias_init": "one", "name": "lstm_1", "b_regularizer": null, "activation": "tanh", "input_dim": 50, "unroll": false, "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null}, "inbound_nodes": [[["embedding_2", 0, 0]]]}, {"class_name": "LSTM", "name": "lstm_2", "config": {"go_backwards": true, "output_dim": 128, "input_length": null, "dropout_U": 0.0, "consume_less": "cpu", "init": "glorot_uniform", "inner_init": "orthogonal", "return_sequences": true, "stateful": false, "trainable": true, "dropout_W": 0.0, "forget_bias_init": "one", "name": "lstm_2", "b_regularizer": null, "activation": "tanh", "input_dim": 50, "unroll": false, "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null}, "inbound_nodes": [[["embedding_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convolution1d_1", "config": {"b_constraint": null, "subsample_length": 1, "nb_filter": 50, "init": "uniform", "activity_regularizer": null, "filter_length": 5, "activation": "linear", "input_dim": null, "W_regularizer": null, "input_length": null, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "bias": true, "name": "convolution1d_1", "trainable": true}, "inbound_nodes": [[["zeropadding1d_1", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"dot_axes": -1, "output_shape": null, "mode_type": "raw", "name": "merge_1", "concat_axis": -1, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "p": 0.1}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "TimeDistributed", "name": "timedistributed_1", "config": {"layer": {"class_name": "Dense", "config": {"output_dim": 50, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "input_dim": null, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_1", "trainable": true}}, "name": "timedistributed_1", "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"dot_axes": -1, "output_shape": null, "mode_type": "raw", "name": "merge_2", "concat_axis": 2, "output_shape_type": "raw", "mode": "concat"}, "inbound_nodes": [[["dropout_1", 0, 0], ["timedistributed_1", 0, 0]]]}, {"class_name": "TimeDistributed", "name": "timedistributed_2", "config": {"layer": {"class_name": "Dense", "config": {"output_dim": 4, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "activation": "softmax", "input_dim": null, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_2", "trainable": true}}, "name": "timedistributed_2", "trainable": true}, "inbound_nodes": [[["merge_2", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["timedistributed_2", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.0"}