{"keras_version": "1.1.0", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "int32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 50]}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"input_dtype": "int32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 50]}, "inbound_nodes": []}, {"name": "embedding_2", "class_name": "Embedding", "config": {"input_dtype": "int32", "input_dim": 3853, "name": "embedding_2", "output_dim": 50, "dropout": 0.2, "trainable": true, "W_regularizer": null, "input_length": 50, "init": "uniform", "mask_zero": false, "batch_input_shape": [null, 50], "W_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"input_dtype": "int32", "input_dim": 3, "name": "embedding_3", "output_dim": 3, "dropout": 0.0, "trainable": true, "W_regularizer": null, "input_length": 50, "init": "uniform", "mask_zero": false, "batch_input_shape": [null, 50], "W_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"output_shape": null, "mode_type": "raw", "dot_axes": -1, "name": "merge_1", "mode": "concat", "output_shape_type": "raw", "concat_axis": -1}, "inbound_nodes": [[["embedding_2", 0, 0], ["embedding_3", 0, 0]]]}, {"name": "zeropadding1d_1", "class_name": "ZeroPadding1D", "config": {"trainable": true, "padding": 2, "name": "zeropadding1d_1"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"inner_init": "orthogonal", "consume_less": "cpu", "return_sequences": true, "unroll": false, "stateful": false, "W_regularizer": null, "trainable": true, "name": "lstm_1", "input_dim": 53, "b_regularizer": null, "input_length": null, "init": "glorot_uniform", "go_backwards": false, "dropout_W": 0.0, "output_dim": 128, "inner_activation": "hard_sigmoid", "activation": "tanh", "dropout_U": 0.0, "U_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"inner_init": "orthogonal", "consume_less": "cpu", "return_sequences": true, "unroll": false, "stateful": false, "W_regularizer": null, "trainable": true, "name": "lstm_2", "input_dim": 53, "b_regularizer": null, "input_length": null, "init": "glorot_uniform", "go_backwards": true, "dropout_W": 0.0, "output_dim": 128, "inner_activation": "hard_sigmoid", "activation": "tanh", "dropout_U": 0.0, "U_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "convolution1d_1", "class_name": "Convolution1D", "config": {"input_dim": null, "filter_length": 5, "W_regularizer": null, "trainable": true, "subsample_length": 1, "name": "convolution1d_1", "b_constraint": null, "input_length": null, "border_mode": "valid", "init": "uniform", "nb_filter": 50, "b_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["zeropadding1d_1", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"output_shape": null, "mode_type": "raw", "dot_axes": -1, "name": "merge_2", "mode": "concat", "output_shape_type": "raw", "concat_axis": -1}, "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "p": 0.1, "name": "dropout_2"}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "timedistributed_1", "class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 50, "W_regularizer": null, "trainable": true, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "activity_regularizer": null}}, "name": "timedistributed_1"}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"output_shape": null, "mode_type": "raw", "dot_axes": -1, "name": "merge_3", "mode": "concat", "output_shape_type": "raw", "concat_axis": 2}, "inbound_nodes": [[["dropout_1", 0, 0], ["timedistributed_1", 0, 0]]]}, {"name": "timedistributed_2", "class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 7, "W_regularizer": null, "trainable": true, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, "name": "timedistributed_2"}, "inbound_nodes": [[["merge_3", 0, 0]]]}], "name": "model_1", "output_layers": [["timedistributed_2", 0, 0]]}}