{"keras_version": "1.1.0", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "input_dtype": "int32", "batch_input_shape": [null, 50], "name": "input_1"}, "name": "input_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"mask_zero": false, "name": "embedding_2", "output_dim": 50, "input_length": 50, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "uniform", "dropout": 0.2, "activity_regularizer": null, "input_dtype": "int32", "batch_input_shape": [null, 50], "input_dim": 3967}, "name": "embedding_2"}, {"class_name": "ZeroPadding1D", "inbound_nodes": [[["embedding_2", 0, 0]]], "config": {"padding": 2, "trainable": true, "name": "zeropadding1d_1"}, "name": "zeropadding1d_1"}, {"class_name": "LSTM", "inbound_nodes": [[["embedding_2", 0, 0]]], "config": {"unroll": false, "stateful": false, "name": "lstm_1", "dropout_W": 0.0, "output_dim": 128, "b_regularizer": null, "W_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "U_regularizer": null, "input_dim": 50, "trainable": true, "go_backwards": false, "dropout_U": 0.0, "forget_bias_init": "one", "input_length": null, "return_sequences": true, "activation": "tanh", "init": "glorot_uniform", "consume_less": "cpu"}, "name": "lstm_1"}, {"class_name": "LSTM", "inbound_nodes": [[["embedding_2", 0, 0]]], "config": {"unroll": false, "stateful": false, "name": "lstm_2", "dropout_W": 0.0, "output_dim": 128, "b_regularizer": null, "W_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "U_regularizer": null, "input_dim": 50, "trainable": true, "go_backwards": true, "dropout_U": 0.0, "forget_bias_init": "one", "input_length": null, "return_sequences": true, "activation": "tanh", "init": "glorot_uniform", "consume_less": "cpu"}, "name": "lstm_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["zeropadding1d_1", 0, 0]]], "config": {"nb_filter": 50, "border_mode": "valid", "name": "convolution1d_1", "filter_length": 5, "b_regularizer": null, "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "input_length": null, "activity_regularizer": null, "activation": "linear", "init": "uniform", "subsample_length": 1}, "name": "convolution1d_1"}, {"class_name": "Merge", "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]], "config": {"output_shape": null, "dot_axes": -1, "mode_type": "raw", "name": "merge_1", "mode": "concat", "concat_axis": -1, "output_shape_type": "raw"}, "name": "merge_1"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution1d_1", 0, 0]]], "config": {"trainable": true, "p": 0.1, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Dropout", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"trainable": true, "name": "timedistributed_1", "layer": {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "output_dim": 50, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "input_dim": null}}}, "name": "timedistributed_1"}, {"class_name": "Merge", "inbound_nodes": [[["dropout_1", 0, 0], ["timedistributed_1", 0, 0]]], "config": {"output_shape": null, "dot_axes": -1, "mode_type": "raw", "name": "merge_2", "mode": "concat", "concat_axis": 2, "output_shape_type": "raw"}, "name": "merge_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"trainable": true, "name": "timedistributed_2", "layer": {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "output_dim": 7, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "input_dim": null}}}, "name": "timedistributed_2"}], "name": "model_1", "output_layers": [["timedistributed_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}