class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  - [input_2, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 50]
      input_dtype: int32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 50]
      input_dtype: int32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Embedding
    config:
      W_constraint: null
      W_regularizer: null
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 50]
      dropout: 0.2
      init: uniform
      input_dim: 3967
      input_dtype: int32
      input_length: 50
      mask_zero: false
      name: embedding_2
      output_dim: 50
      trainable: true
    inbound_nodes:
    - - [input_1, 0, 0]
    name: embedding_2
  - class_name: Embedding
    config:
      W_constraint: null
      W_regularizer: null
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 50]
      dropout: 0.0
      init: uniform
      input_dim: 3
      input_dtype: int32
      input_length: 50
      mask_zero: false
      name: embedding_3
      output_dim: 3
      trainable: true
    inbound_nodes:
    - - [input_2, 0, 0]
    name: embedding_3
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_1,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [embedding_2, 0, 0]
      - [embedding_3, 0, 0]
    name: merge_1
  - class_name: ZeroPadding1D
    config: {name: zeropadding1d_1, padding: 2, trainable: true}
    inbound_nodes:
    - - [merge_1, 0, 0]
    name: zeropadding1d_1
  - class_name: LSTM
    config: {U_regularizer: null, W_regularizer: null, activation: tanh, b_regularizer: null,
      consume_less: cpu, dropout_U: 0.0, dropout_W: 0.0, forget_bias_init: one, go_backwards: false,
      init: glorot_uniform, inner_activation: hard_sigmoid, inner_init: orthogonal,
      input_dim: 53, input_length: null, name: lstm_1, output_dim: 128, return_sequences: true,
      stateful: false, trainable: true, unroll: false}
    inbound_nodes:
    - - [merge_1, 0, 0]
    name: lstm_1
  - class_name: LSTM
    config: {U_regularizer: null, W_regularizer: null, activation: tanh, b_regularizer: null,
      consume_less: cpu, dropout_U: 0.0, dropout_W: 0.0, forget_bias_init: one, go_backwards: true,
      init: glorot_uniform, inner_activation: hard_sigmoid, inner_init: orthogonal,
      input_dim: 53, input_length: null, name: lstm_2, output_dim: 128, return_sequences: true,
      stateful: false, trainable: true, unroll: false}
    inbound_nodes:
    - - [merge_1, 0, 0]
    name: lstm_2
  - class_name: Convolution1D
    config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
      b_constraint: null, b_regularizer: null, bias: true, border_mode: valid, filter_length: 5,
      init: uniform, input_dim: null, input_length: null, name: convolution1d_1, nb_filter: 50,
      subsample_length: 1, trainable: true}
    inbound_nodes:
    - - [zeropadding1d_1, 0, 0]
    name: convolution1d_1
  - class_name: Merge
    config: {concat_axis: -1, dot_axes: -1, mode: concat, mode_type: raw, name: merge_2,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [lstm_1, 0, 0]
      - [lstm_2, 0, 0]
    name: merge_2
  - class_name: Dropout
    config: {name: dropout_2, p: 0.1, trainable: true}
    inbound_nodes:
    - - [convolution1d_1, 0, 0]
    name: dropout_2
  - class_name: Dropout
    config: {name: dropout_1, p: 0.2, trainable: true}
    inbound_nodes:
    - - [merge_2, 0, 0]
    name: dropout_1
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: null, name: dense_1, output_dim: 50, trainable: true}
      name: timedistributed_1
      trainable: true
    inbound_nodes:
    - - [dropout_2, 0, 0]
    name: timedistributed_1
  - class_name: Merge
    config: {concat_axis: 2, dot_axes: -1, mode: concat, mode_type: raw, name: merge_3,
      output_shape: null, output_shape_type: raw}
    inbound_nodes:
    - - [dropout_1, 0, 0]
      - [timedistributed_1, 0, 0]
    name: merge_3
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: softmax, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: null, name: dense_2, output_dim: 7, trainable: true}
      name: timedistributed_2
      trainable: true
    inbound_nodes:
    - - [merge_3, 0, 0]
    name: timedistributed_2
  name: model_1
  output_layers:
  - [timedistributed_2, 0, 0]
keras_version: 1.1.0
