{"config": {"name": "model_1", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 50], "name": "input_1", "input_dtype": "int32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"sparse": false, "batch_input_shape": [null, 50], "name": "input_2", "input_dtype": "int32"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"init": "uniform", "output_dim": 50, "W_constraint": null, "W_regularizer": null, "name": "embedding_2", "trainable": true, "dropout": 0.2, "activity_regularizer": null, "input_length": 50, "batch_input_shape": [null, 50], "input_dtype": "int32", "mask_zero": false, "input_dim": 3967}, "class_name": "Embedding", "name": "embedding_2", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"init": "uniform", "output_dim": 3, "W_constraint": null, "W_regularizer": null, "name": "embedding_3", "trainable": true, "dropout": 0.0, "activity_regularizer": null, "input_length": 50, "batch_input_shape": [null, 50], "input_dtype": "int32", "mask_zero": false, "input_dim": 3}, "class_name": "Embedding", "name": "embedding_3", "inbound_nodes": [[["input_2", 0, 0]]]}, {"config": {"dot_axes": -1, "mode": "concat", "output_shape": null, "name": "merge_1", "output_shape_type": "raw", "mode_type": "raw", "concat_axis": -1}, "class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["embedding_2", 0, 0], ["embedding_3", 0, 0]]]}, {"config": {"padding": 2, "name": "zeropadding1d_1", "trainable": true}, "class_name": "ZeroPadding1D", "name": "zeropadding1d_1", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"input_length": null, "input_dim": 53, "unroll": false, "b_regularizer": null, "inner_activation": "hard_sigmoid", "return_sequences": true, "U_regularizer": null, "W_regularizer": null, "name": "lstm_1", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "activation": "tanh", "forget_bias_init": "one", "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "stateful": false, "consume_less": "cpu", "dropout_U": 0.0}, "class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"input_length": null, "input_dim": 53, "unroll": false, "b_regularizer": null, "inner_activation": "hard_sigmoid", "return_sequences": true, "U_regularizer": null, "W_regularizer": null, "name": "lstm_2", "output_dim": 128, "trainable": true, "init": "glorot_uniform", "activation": "tanh", "forget_bias_init": "one", "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": true, "stateful": false, "consume_less": "cpu", "dropout_U": 0.0}, "class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"b_constraint": null, "input_dim": null, "subsample_length": 1, "filter_length": 5, "W_regularizer": null, "name": "convolution1d_1", "trainable": true, "W_constraint": null, "nb_filter": 50, "input_length": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "uniform", "border_mode": "valid", "bias": true}, "class_name": "Convolution1D", "name": "convolution1d_1", "inbound_nodes": [[["zeropadding1d_1", 0, 0]]]}, {"config": {"dot_axes": -1, "mode": "concat", "output_shape": null, "name": "merge_2", "output_shape_type": "raw", "mode_type": "raw", "concat_axis": -1}, "class_name": "Merge", "name": "merge_2", "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]]}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.1}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"config": {"layer": {"config": {"b_constraint": null, "output_dim": 50, "bias": true, "W_regularizer": null, "name": "dense_1", "trainable": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, "name": "timedistributed_1", "trainable": true}, "class_name": "TimeDistributed", "name": "timedistributed_1", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"config": {"dot_axes": -1, "mode": "concat", "output_shape": null, "name": "merge_3", "output_shape_type": "raw", "mode_type": "raw", "concat_axis": 2}, "class_name": "Merge", "name": "merge_3", "inbound_nodes": [[["dropout_1", 0, 0], ["timedistributed_1", 0, 0]]]}, {"config": {"layer": {"config": {"b_constraint": null, "output_dim": 7, "bias": true, "W_regularizer": null, "name": "dense_2", "trainable": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "softmax", "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, "name": "timedistributed_2", "trainable": true}, "class_name": "TimeDistributed", "name": "timedistributed_2", "inbound_nodes": [[["merge_3", 0, 0]]]}], "output_layers": [["timedistributed_2", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.0"}