{"keras_version": "1.1.0", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "input_1", "input_dtype": "int32", "sparse": false}}, {"name": "embedding_2", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Embedding", "config": {"output_dim": 50, "activity_regularizer": null, "dropout": 0.2, "init": "uniform", "trainable": true, "W_constraint": null, "name": "embedding_2", "input_dtype": "int32", "mask_zero": true, "W_regularizer": null, "input_dim": 3967, "batch_input_shape": [null, 50], "input_length": 50}}, {"name": "lstm_1", "inbound_nodes": [[["embedding_2", 0, 0]]], "class_name": "LSTM", "config": {"U_regularizer": null, "return_sequences": true, "output_dim": 128, "inner_init": "orthogonal", "b_regularizer": null, "consume_less": "cpu", "init": "glorot_uniform", "trainable": true, "dropout_W": 0.0, "unroll": false, "inner_activation": "hard_sigmoid", "input_dim": 50, "forget_bias_init": "one", "dropout_U": 0.0, "activation": "tanh", "W_regularizer": null, "go_backwards": false, "stateful": false, "input_length": null, "name": "lstm_1"}}, {"name": "lstm_2", "inbound_nodes": [[["embedding_2", 0, 0]]], "class_name": "LSTM", "config": {"U_regularizer": null, "return_sequences": true, "output_dim": 128, "inner_init": "orthogonal", "b_regularizer": null, "consume_less": "cpu", "init": "glorot_uniform", "trainable": true, "dropout_W": 0.0, "unroll": false, "inner_activation": "hard_sigmoid", "input_dim": 50, "forget_bias_init": "one", "dropout_U": 0.0, "activation": "tanh", "W_regularizer": null, "go_backwards": true, "stateful": false, "input_length": null, "name": "lstm_2"}}, {"name": "merge_1", "inbound_nodes": [[["lstm_1", 0, 0], ["lstm_2", 0, 0]]], "class_name": "Merge", "config": {"name": "merge_1", "output_shape": null, "concat_axis": -1, "mode_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "mode": "concat"}}, {"name": "dropout_1", "inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"name": "timedistributed_1", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"output_dim": 7, "bias": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "dense_1", "input_dim": null, "W_regularizer": null, "activation": "softmax", "b_constraint": null}}, "name": "timedistributed_1", "trainable": true}}], "output_layers": [["timedistributed_1", 0, 0]]}, "class_name": "Model"}